[{"position": "Data Engineer", "company": "Dice", "date": "3 minutes ago", "type": "Contract · Entry level", "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, ReqRoute, Inc, is seeking the following. Apply via Dice today!\nOur Client is a leader in building software that drives their customers business, for enterprises and software product companies with software at the core of their transformation.\nWe have an urgent need for Data Engineer for one of their large engagements. Please share the updated resume with contact information if you would like to Evaluate.\n Title: Data Engineer \n Location: Remote \n Type: Contract to Hire \n Job Description: \n Someone with strong SQL skills is critical, including ETL and SQL views. They should have at least 3+ years ETL experience.  Specific experience with AWS and Redshift would reduce the learning curve and be very helpful but is not critical.  Good communication skills and ability to work independently yet with guidance are important.  Experience with Salesforce, particularly Tableau CRM or Einstein Analytics (Recipies or Data Sync) are not needed but are a big plus.  Python experience is preferred.  Kafka experience is a nice-to-have, Informatica experience is a nice-to-have.  The person would need to work US Central Time-zone hours; remote is acceptable.  - provided by Dice"}, {"position": "Junior Software Engineer", "company": "Wiley Edge", "date": "1 week ago", "type": "$55,000/yr - $60,000/yr · Full-time · Entry level", "description": "Want to start your career as a Software Developer?\nPaid graduate training, ongoing support, opportunities at leading global employers – the Alumni graduate program gives you everything you need. (And don’t worry, there’s no training bond. No exit fees, no hidden catches).\nHere at Wiley Edge, we pair great graduates with brilliant global businesses. Our clients include tier one investment banks and other organizations across a range of industries, from insurance to healthcare to travel.\nWhat you’ll do:\nAs a Software Developer with Wiley Edge, you’ll build complex applications in a global team environment.\nYou’ll love seeing the impact you make when code you’ve written launches to the people who need it. If you stay on the lookout for new ways to get better results through Software Development, you’ll become an asset to your team.How the Alumni program works:\nApply via this job advert.Complete our assessment process.Get trained at Wiley Edge Academy in an online class for 4-8 weeks with other graduates. Focusing on Full Stack Java Devlopment.Join an Wiley Edge client for 12-24 months while receiving support and salary increases every 6 months.Have the opportunity to convert to a full-time, permanent employee with the client at the end of the consultancy.\nWhat you’ll learn at the Wiley Edge Academy:How to design, develop, and test a full-stack application.How to demonstrate professionalism, including communication skills and personal interactions.How to explain industry concepts at a high level.An understanding of monitoring, supporting, and troubleshooting, and how it ties into good development processes.\nWhat you need:Bachelor's degree in computer science or a related STEM subject (science, technology, engineering, math).Experience with OOP (object oriented programming).Solid knowledge of software engineering principles (data structures, OOP, design patterns, multithreading).Skills in troubleshooting and debugging.Knowledge of database concepts (SQL, stored procs, schema design).An understanding of the formal SDLC (software development lifecycle).An understanding of test-driven development.The right to work without needing visa sponsorship.\nWhat you'll get:Fully paid, in-depth, interactive training in small classes with graduates like you. Our training is created and delivered by industry experts who know your field inside out.A generous graduate salary.Pay rises every 6 months to reflect your progress.A flexible benefits package including gym membership.Ongoing training and support.Valuable industry experience. Ultimately, a foot in the door to build your career in an in-demand niche.\nHow to apply:Hit ‘Apply Now’ to tell us a bit about you.Complete the online assessment (we’ll send you a link by email).Complete the interviews with our friendly talent team over phone and video.Lastly, you’ll interview with one or more of our clients.\nSo you don’t miss out on your dream job, we encourage you to be open to relocating.We take great pride in celebrating the diversity of each and every individual who contributes to making mthree the company it is today and will be in the future. We value diversity both within Wiley Edge and with our partner companies, and we're proud to provide an environment where all our colleagues can flourish. That means promoting a strong culture of equality but, most importantly, inclusion. We never want people to change - only add to the amazing mix of people that work for Wiley Edge.\nA requirement for this role may be to attest and provide proof of vaccination for COVID-19 upon hire"}, {"position": "Junior Sharepoint Developer", "company": "Dice", "date": "3 minutes ago", "type": "Contract · Entry level", "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Certitude Business solutions llc, is seeking the following. Apply via Dice today!\nSharePoint Designer and Developer : Riverwoods, open for remote.\nClient Name:Bitwise Discover\nCTC\nOverview:\nSharePoint Intranet Designer and Developer is needed to create a customized organizational intranet. You will be responsible for configuring and customizing SharePoint systems according to company specifications, building scalable web applications, writing, and modifying code, debugging software. You will also be required to work with business to understand the problem/process and come up with technical solutions.\nResponsibilities:\nMeeting with the business team to understand application requirements.\nSetting tasks and development goals.\nConfiguring The Company SharePoint Systems To Specified Requirements.\nDeveloping new web components using HTML, CSS, JS, Jquery.\nDesigning, coding, and implementing scalable applications.\nExtending SharePoint functiona lity with forms, web parts, and application technologies.\nTesting and debugging code.\nInteracting with SharePoint webservices for CRUD operations.\nReviewing website interface and software stability.\nTroubleshooting software issues.\nMaintaining and updating SharePoint applicatio ns.\nRequirements:\nCandidate must have proficiency in JavaScript, CSS, HTML, JQuery, Vue.js and be able to implement the designs that they have created in partnership with our business partners\nUnderstanding of the basics of User Experience (UX) design, including design patterns and best practices\nThe ability to create attractive Web Designs that are in line with the Discover brand aesthetics\nStrong communication skills are needed for working closely with business stakeholders to assess their needs and implement an intuitive, attractive, and accessible user interface\nPrevious experience as a SharePoint developer.\nLocation: Riverwoods, open for remote.\n provided by Dice"}, {"position": "Golang Development Engineer", "company": "Dice", "date": "3 minutes ago", "type": "Contract · Entry level", "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Experis, is seeking the following. Apply via Dice today!\nExperis, a ManpowerGroup company has an exciting contract opportunity for Golang Developer(Open for C2C) Onsite position. This position is a 12 months contract for one of our key clients, A purpose-led organization that is building a meaningful future through innovation, technology, and collective knowledge.\nRole: Golang Developer\nLocation: Austin, TX/Sunnyvale, CA(Day 1 Onsite)\nDuration: 12 Months\n5+ years developing large scale enterprise softwareStrong programming skills (ability to create efficient algorithms and data structures)Expertise in one or more of the following programming languages: Go (required), Java, C, Rust, ScalaExpertise in the following scripting languages: Python (required), Shell scriptExpertise in one or more of the following query languages: SQL (required), NoSQL, SparkSQLGood working knowledge of Unix/Linux systems (filesystems, system calls, etc.)Good working knowledge of version control and repositories such as Git, and CI/CD processGood understanding and at least a basic working knowledge in socket programming (TCP/IP, HTTP/S, etc.)Experience in cloud and container based deployments, using AWS, Kubernetes etc. is a plusExperience in security and vulnerabilities is a plusDriven to automate and continuously improvePassionate about keeping our customers data safeAbility to track and manage numerous parallel activitiesTrack record of practical problem solving, excellent communication and documentation skillsComfortable in a fast-paced dynamic agile environmentHigh standard of ethicsGood knowledge of integrating, analyzing, and presenting relevant metrics for very large data sets\nPlease Apply Today!\n provided by Dice"}, {"position": "Jr. Software Engineer", "company": "System One", "date": "2 weeks ago", "type": "Contract · Entry level", "description": "Jr. C++/Java \n\nLocation: 100% onsite in Gaithersburg, MD\n\nSalary: 120-165Kish\n\n Per client requirement US Citizen \n Multi-year contract\nALTA IT Services is looking for a or a hands-on Jr. C++/Java, Senior Software Engineer, for a SATCOM hub project with 3-5 years experience.\n\nResponsibilities\n Work from system requirements through to system delivery  Develop robust system and high-level software designs and implementations that meet requirements  Collaborate with customers, software engineering, product owners and program management to develop, test and integrate software solutions that meet requirements  Resolve issues raised by implementation teams in a timely and effective manner \nRequirements\n Bachelor's of Science in Engineering or a related discipline  5+ years of software development experience in C and C++  3+ years of Python experience  Must be capable of obtaining and holding a U.S. government security clearance \nPreferred Qualifications\n MS degree in engineering related discipline  Experience with a system modelling tool e.g. Enterprise Architect  Experience working in agile project environment e.g. Scrum  Experience working on a satellite telecommunications system  Experience with Jira, Confluence, BitBucket, Jenkins, SonarQube and Artifactory  Experience of applying computer networking principles to project designs  Experience reviewing software implementations to ensure they meet system requirements  Experience writing technical documents \nFor immediate consideration, please apply directly or contact Sunita Mehta at Smehta@altaits.com or 301-461-3235. \n\nSystem One, and its subsidiaries including Joulé, ALTA IT Services, CM Access, and MOUNTAIN, LTD., are leaders in delivering outsourced services and workforce solutions across North America. We help clients get work done more efficiently and economically, without compromising quality. System One not only serves as a valued partner for our clients, but we offer eligible full-time employees health and welfare benefits coverage options including medical, dental, vision, spending accounts, life insurance, voluntary plans, as well as participation in a 401(k) plan.\n\nSystem One is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, age, national origin, disability, family care or medical leave status, genetic information, veteran status, marital status, or any other characteristic protected by applicable federal, state, or local law."}, {"position": "Quantitative Developer", "company": "Arrowstreet Capital, Limited Partnership", "date": "1 week ago", "type": "Full-time · Associate", "description": "Team OverviewWe are looking for Quantitative Developers to join our Research group. We are a collaborative, data-driven, intellectually rigorous team responsible for coming up with investment ideas, codifying those ideas into signals, back-testing the signals, and producing return, risk and trading cost forecasts based on the signals to drive trading decisions. We maintain a friendly, team-oriented environment and place a high value on professionalism, attitude and initiative.\n\nOur quantitative development team within Research is responsible for the tools, APIs, libraries and software engineering techniques to support faster generation, evaluation and productionization of investment ideas.\n\nAs a Quantitative Developer, you will help build our next-generation Research data platform leveraging open-source, cloud and distributed computing technologies. You will work on high-impact projects that are quickly adopted and drive change across the team.\n\nResponsibilities Your responsibilities are expected to grow in line with your experience and abilities. Depending on your competitive advantages, typical responsibilities may include:> Writing and maintaining Python and R code that supports the investment research production processes> Designing and creating software to enhance our data science technology stack> Performing ad-hoc exploratory statistical analysis across multiple large complex data sets from a variety of structured and unstructured sources> Implementing performance improvements in our data analysis and numerical programming code> Running POCs to evaluate new technologies and libraries in the PyData ecosystem> Staying up to date on the PyData ecosystem and evaluating new libraries and tools> Working with software engineers to design feeds for new data sources from third-party vendors\n\nQualifications> An undergraduate or graduate degree in computer science with a quantitative application such as mathematics and/or finance, or vice versa – a quantitative degree with a computer science application> Demonstrated professional or academic success (recent graduates are encouraged to apply)> Strong analytical, quantitative, and problem solving skills> Experience implementing production-grade Python code for a data analytic business, preferably in investment management> Expert programming skills in Python with pandas and numpy> Expertise in OOP paradigms, data structures, and numerical algorithms> Understanding of probability and statistics, including linear regression and time-series analysis> Curiosity and a willingness to learn new technologies> Interest in financial markets (prior experience not required)> Excellent communication skills, including data visualization> High energy and strong work ethic\n\nIn addition, experience with any of the following would be valuable:\n> Some experience programming in R with tidyverse packages> High-performance computing> Distributed computing> Hadoop, Spark, Kafka, and related technologies> SQL> Unix/Linux system tools and environment> Basic familiarity with unit testing, continuous integration, DevOps, containerization> Interactive data visualization and dashboards"}, {"position": "Machine Learning Engineer - All Levels (REMOTE)", "company": "GEICO", "date": "2 weeks ago", "type": "Full-time", "description": "If you are an ML Engineer looking to work on some of the latest and most interesting projects while utilizing the most cutting-edge technologies, then continue reading. GEICO’s AI & ML Engineering team is responsible for building and enabling GEICO to build AI/ML products and services for the future. Our team is also responsible for designing, building, testing and maintaining the Machine Learning platform supporting Data Science initiatives across many groups. We are looking for a highly motivated individual with the ability to solve difficult problems, learn new technologies and push the boundaries of what is possible. A successful candidate must have excellent verbal and written communication skills. The candidate must also be able to work independently and in a team environment.\nRequired Qualifications\n4+ years of development experienceExperience with end-to-end Machine Learning Engineering lifecycleExperience with Cloud Platforms such as MS Azure, AWS, or Google CloudExperience with Machine Learning cloud technologies such as Azure Machine Learning (AML), AWS SageMaker or Spark MLExperience with Big Data platforms such as Databricks or Apache SparkExperience writing Production quality code in Scala, PySpark, Python and/or JavaExperience with SQLMonitoring pipelines for issues or errors and diagnosing/resolving problems \nDesired Qualifications\nMaster’s degree in computer science or related field Experience with the Azure Ecosystem (Azure Data Lake, Azure Data Factory, Azure Databricks, Azure Machine Learning (AML), Azure Cognitive Services, Azure Storage)Experience with CI/CD pipelinesExperience with Azure DevOps (ADO)Experience developing ADO tasks, variable groups and pipelinesExperience with telemetry, alerts and monitoring Experience with Azure Monitor, AppInsights, Dynatrace, and/or Splunk Knowledge of Kubernetes or Azure Kubernetes Service (AKS) Experience with data streaming infrastructure deployment (e.g., Spark Streaming, Kafka, Azure EventHub, or EventBridge) Experience with performance tuning with applications processing large amounts of dataExperience working with Hadoop, SQL, No-SQL platformsExperience with various file formats such as AVRO, JSON, and PARQUET Experience with Load Testing and Quality Assurance \nBenefits\nAs a full time associate, you’ll enjoy our Total Rewards Program* to help secure your financial future and preserve your health and well-being, including:\nPremier Medical, Dental and Vision Insurance with no waiting period**Paid Vacation, Sick and Parental Leave401(k) Plan Tuition Assistance including Direct Billing and Reimbursement payment plan optionsPaid Training, Licensures, and CertificatesBenefits may be different by location. Benefit eligibility requirements vary and may include length of service.Coverage begins with the pay period after hire date. Must enroll in New Hire Benefits within 30 days of the date of hire for coverage to take effect.\nGEICO is proud to be an equal opportunity employer. We are committed to cultivating an environment where equal employment opportunities are available to all associates and job applicants regardless of race, color, religious creed, national origin, ancestry, age, gender, pregnancy, sexual orientation, gender identity, marital status, familial status, disability or genetic information, in compliance with applicable federal, state and local law. GEICO celebrates diversity and believes it is critical to our success. As such, we are committed to recruit, develop and retain the most talented individuals to join our team"}, {"position": "Software Engineering Intern", "company": "Johnson Controls", "date": "1 week ago", "type": "Full-time · Internship", "description": "Job Details \n\nAre you looking for an exciting opportunity to gain valuable hands-on career experience while working on meaningful strategic projects? Do you want to work with skilled, experienced professionals on challenging and impactful assignments that help improve our world? Johnson Controls is powered by ideas and energy. We are continuously searching for fresh innovative ideas from bright, inquiring minds. As a member of the Johnson Controls Future Leaders Internship Program, your valuable skill set, knowledge, and passion will help us continue to excel in a dynamic and competitive global environment. This program is a unique opportunity to put classroom theory into practice while bolstering your resume and professional network. By joining a program that is rooted in community, connection, and memorable experiences, you will have an opportunity to transform your future. #NextGenJCI #internships\n\nWhat You Will Do\n\nJohnson Controls invites you to apply for an internship located in Seattle, WA . This internship is designed to provide you with a positive work/training experience and challenging objectives. join the software engineering team and work as a team member under direction of experienced engineers. You will apply and enhance your engineering skills to develop, test, and support software related products.\n\nThis is an onsite (non-remote) position located in Seattle, WA . starting Summer 2023.\n\nHow You Will Do It\nSummer 2023 - possibility to stay additional time or repeat the following summerTasked with a specific projectAttend provided enrichment/ development sessionsLearning about the general product requirements.Assisting engineering team with robotics., physical security and AI related work.Assisting development team with testing and troubleshooting defects.\nWhat We Look For\n\nRequired Qualifications:\nCurrently enrolled as a full-time student at an accredited U.S. college or university.Pursuing a B.S. in Electrical, Computer, or Software Engineering with a Graduation date no sooner than Dec 2023.Currently a Sophomore/Junior statusGood Academic StandingU.S. citizen or legal right to work in the U.S.Ability to work 40 hrs a week in the Seattle, WA.Where legally permissible, if hired, candidate is required to be fully vaccinated against Covid-19 no later than his/her start date, unless candidate has a valid medical condition or sincerely held religious belief precluding he/she from receiving the vaccine.\nPreferred Qualifications\nDemonstrates an ability to learn quickly and independently.Strong communication skills (verbal and written) preferredDemonstrated problem solving skills requiredExperience with C/C++\nAbout Us\n\nJohnson Controls is an equal employment opportunity and affirmative action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, status as a qualified individual with a disability, or any other characteristic protected by law. For more information, please view EEO is the Law. If you are an individual with a disability and you require an accommodation during the application process, please visit www.johnsoncontrols.com/tomorrowneedsyou.\n\nJohnson Controls International plc. is an equal employment opportunity and affirmative action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, genetic information, sexual orientation, gender identity, status as a qualified individual with a disability or any other characteristic protected by law. To view more information about your equal opportunity and non-discrimination rights as a candidate, visit EEO is the Law. If you are an individual with a disability and you require an accommodation during the application process, please visit here."}, {"position": "QRadar Engineer", "company": "Dice", "date": "3 minutes ago", "type": "Contract · Entry level", "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Dexperts Inc, is seeking the following. Apply via Dice today!\nJob Details:\nJob Title: QRadar Engineer\nLocation: 100% Remote\nDuration: 1+ Months Contract\nDescription:\nNeed very solid QRadar consultant who has experience working on 100,000+ node environment. This is for Deloitte for State of New York. Need SME level.\nThe consultant will assist with the implementation and integration of IBM QRadar SIEM, SOAR and Threat Hunting platforms with JSOC threat hunting platform, log search engine, and ticketing/case management platforms, as well as assist with the development of scalable and modular SOAR playbooks to reduce time-to-action for alert creation, triage, investigation, response, and recovery.\nThis position's role will be to build and implement QRadar and set it up and configure it based on direction from the client.\n provided by Dice"}, {"position": "Software Developer II", "company": "Jobs via eFinancialCareers", "date": "1 day ago", "type": "Full-time · Entry level", "description": "Engineer II, Software Development\n The Team: We are looking for a highly motivated, enthusiastic, and skilled engineering lead for Market Intelligence. We strive to deliver solutions that are sector-specific, data-rich, and hyper-targeted for evolving business needs. Our lead Software developers are involved in the full product life cycle, from design through release. You will be expected to participate in the design review process, write high-quality code, and work with a dedicated team of QA Analysts, Business Analysts, and Infrastructure Teams.\n\nThe Impact:\n\nMarket Intelligence is seeking a Lead Software Developer to create software design, development, and maintenance for data processing applications. This person would be part of a development team that manages and supports the internal & external applications that is supporting the business portfolio. This role expects a candidate to handle any data processing, big data application development. We have teams made up of people that learn how to work effectively together while working with the larger group of developers on our platform. Become an integral part of a high performing global network of engineers working from India, Denver, New York, and London to help advance our technology.\n\nWhat's in it for you:\n Ability to work with and build a world class Platform Engineering group. Highly technical hands-on role which will help enhance team skills. Fast-paced agile environment that deals with huge volumes of data, so you'll have an opportunity to sharpen your software development and data skills and work on an emerging technology stack. Work on Tier-1 applications that are in the critical path for the business. Ability to work on cutting edge technologies such as Cloud AWS, NIFI. Ability to grow within the organization that's part of the global team.\n\nCompensation/Benefits Information (US Applicants Only):\n\nS&P Global states that the anticipated base salary range for this position is $46,200 - $129,200. Base salary ranges may vary by geographic location.\n\nIn addition to base compensation, this role is eligible for an annual incentive bonus/a sales commission plan.\n\nThis role is eligible to receive additional S&P Global benefits. For more information on the benefits we provide to our employees, visit https://www.spgbenefitessentials.com/newhires .\n\nResponsibilities\n Design and development of applications for S&P Global Market Intelligence web sites and its content systems. Participate in multiple software development processes including Coding, Testing, De-bugging & Documentation. Develop software applications based on clear business specifications. Work on new initiatives and support existing content applications. Perform Application & System Performance tuning and troubleshoot performance issues. Develop web-based applications and build rich front-end user interfaces. Build applications with object-oriented concepts and apply design patterns. Integrate in-house applications with various vendor software platforms. Setup development environment / sandbox for application development. Check-in application code changes into the source repository. Perform unit testing of application code and fix errors. Interface with databases to extract information and build reports. Effectively interact with customers, business users and IT staff.\n\nBasic Qualifications:\n Bachelors/Master's Degree in Computer Science, Information Systems or equivalent. 3+ year's experience in application development Strong . NET(C#) and SQL skills Proficient with software development lifecycle (SDLC) methodologies like SAFe, Test-driven development Proficiency in the development environment, including IDE, web & application server, GIT, Continuous Integration, unit-testing tool and defect management tools Experience with SQL and NoSQL databases Experience with Object oriented Java script such as React JS, Angular JS, Ext-JS Experience with Big Data platforms such as Apache Hadoop and Apache Spark, NiFi Experience with stream processing engines like Kafka etc. Expertise in building even driven scalable & resilient systems Demonstrates a thorough understanding of information systems, business processes, the key drivers and measures of success while choosing the proper methodologies and policies to support broad business goals Excellent communication skills are essential, with strong verbal and writing proficiencies. Experience in the Financial services domain is a plus.\n\nPreferred Qualifications:\n Experience working in cloud computing environments such as AWS, Azure, or GCP Experience in SnowFlake, Databricks\n\nS&P Global Market Intelligence\n\nAt S&P Global Market Intelligence, we know that not all information is important-some of it is vital. Accurate, deep and insightful. We integrate financial and industry data, research and news into tools that help track performance, generate alpha, identify investment ideas, understand competitive and industry dynamics, perform valuation and assess credit risk. Investment professionals, government agencies, corporations and universities globally can gain the intelligence essential to making business and financial decisions with conviction.\n\nS&P Global Market Intelligence is a division of S&P Global (NYSE: SPGI), which provides essential intelligence for individuals, companies, and governments to make decisions with confidence. For more information, visit www.spglobal.com/marketintelligence .\n\nS&P Global is an equal opportunity employer committed to making all employment decisions without regard to race/ethnicity, sex, pregnancy, gender identity or expression, color, creed, religion, national origin, age, disability, marital status (including domestic partnerships and civil unions), sexual orientation, military veteran status, unemployment status, or any other basis prohibited by federal, state or local law. Only electronic job submissions will be considered for employment.\n\nIf you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\nThe EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.\n\nEqual Opportunity Employer\n\nS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment.\n\nIf you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\n US Candidates Only:  The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.\n\n20 - Professional (EEO-2 Job Categories-United States of America), IFTECH202.1 - Middle Professional Tier I (EEO Job Group), SWP Priority - Ratings - (Strategic Workforce Planning)\n\nJob ID: 268058\n\nPosted On: 2022-10-17\n\nLocation: Virtual, Virginia, United States"}, {"position": "Backend Engineer - Data Modelling", "company": "Clevertech", "date": "1 week ago", "type": "Full-time · Mid-Senior level", "description": "Experience Remote done Right. Over 20 years of remote experience, all 500+ staff are 100% remote and we still grow vibrant relationships, provide exceptional opportunities for career growth while working with stellar clients on ambitious projects\nWhat we're working on:Enterprise companies turn to us to help them launch innovative digital products that interact with hundreds of millions of customers, transactions and data points. The problems we solve every day are real and require creativity, grit and determination. We are building a culture that challenges norms while fostering experimentation and personal growth. In order to grasp the scale of problems we face, ideally, you have some exposure to Logistics, FinTech, Transportation, Insurance, Media or other complex multifactor industries\nRequirements7+ years of professional experience (A technical assessment will be required)Senior-level experience with Javascript, NodeJS, ETL/APIExperience with Python, Redshift, and Snowflake are ideal but not necessaryExperience with data modelling; handling large-scale systems and managing data pipelinesHave an understanding of how to accurately process the data to allow reporting on time-based metricsBe able to support front-end developers in building user-facing appsAbility to create clean, modern, testable, well-documented codeEnglish fluency, verbal and writtenProfessional, empathic, team player\nStraight from the DevsWatch short snippets of actual developers (Real, not scripted) share why they joined YouTube Playlist\nWhy Clevertech is an amazing place to work atAt Clevertech, you can expect that you will:Be 100% dedicated to one project at a time so that you can hone your skills, innovate and growBe a part of a team of talented and friendly senior-level developersWork on projects that allow you to use cutting edge tech. We believe in constantly evolving your mastery\n\nThe result? We produce meaningful work and we are truly proud and excited to be creating waves in an industry under transformation."}, {"position": "Software Engineer, TikTok E-Commerce Recommendation - US Tech Services", "company": "TikTok", "date": "2 weeks ago", "type": "Full-time", "description": "Responsibilities\n\n TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Mumbai, Singapore, Jakarta, Seoul and Tokyo. \n\nWhy Join Us\nAt TikTok, our people are humble, intelligent, compassionate and creative. We create to inspire - for you, for us, and for more than 1 billion users on our platform. We lead with curiosity and aim for the highest, never shying away from taking calculated risks and embracing ambiguity as it comes. Here, the opportunities are limitless for those who dare to pursue bold ideas that exist just beyond the boundary of possibility. Join us and make impact happen with a career at TikTok.\n\nOur E-commerce Recommendation Team is responsible for building up and scaling our recommendation system to provide the most stable and best experience for our TikTok users.\n\nResponsibilities - What You'll Do\n• Build and maintain high performance online shopping services for TikTok E-commerce recommendation system；\n• Investigate design approaches, prototype new technology and evaluate technical feasibility.\n• Develop and optimize e-commerce high-performance real-time computing framework, supporting the performance optimization and business landing of algorithms including CV, NLP, multimodal and graph.\n• Develop and maintain batch tasks that process very large-scale product/video/live streaming data in e-commerce. \n\nQualifications\n\n • Bachelor's degree or above, majoring in Computer Science, or related fields, with 2+ years of experience building scalable system;\n• Experience programming in at least one programming language;\n• Effective communication skills and a sense of ownership and drive;\n• Experienced in at least one area of the following areas: personalized recommendations, search engine, machine learning, distributed storage system, big data frameworks is a plus. \n\nTikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.\n\nTikTok is committed to providing reasonable accommodations during our recruitment process. If you need assistance or an accommodation, please reach out to zoe.louie@bytedance.com"}, {"position": "Algorithm Engineer", "company": "Sony Electronics", "date": "2 weeks ago", "type": "Full-time · Mid-Senior level", "description": "Sony Electronics Inc. is looking for the risk-takers, the collaborators, the inspired and the inspirational. We want the people who are brave enough to work at the cutting edge and create solutions that will enrich and improve the lives of people across the globe. In addition to competitive pay and benefits, we offer an environment and culture that promotes Diversity, Equity and Inclusion. In addition, our team members enjoy innovative work-life balance opportunities including a hybrid home/office workplace, monthly “Free Fridays”, and early shutdowns on Fridays throughout the year (including half-days during the summer).\nSo, if you want to join a “Best Place to Work” company and make the world say wow, let's talk.\nThe Image Sensor Design Center (ISDC) in Sony Electronics currently has an opening for an Algorithm Engineer in their San Jose, CA location. This position is part of an advanced technology team which is enabling the next generation of imaging. The successful candidate will bring proven experience in machine learning and computer vision to develop image processing algorithms for future Sony image sensor products.\nResponsibilities\nDesign and implementation of deep learning algorithms.Optimization of algorithms for efficient hardware implementation.Evaluation of algorithms in real-world scenarios.Attend meetings to collaborate with different members to support project.\nMinimum Qualifications\nMaster’s Degree in Electrical Engineering, Computer Science, Mathematics, or equivalent field.3+ years of experience in signal/image processing algorithm research & development.Deep knowledge of machine learning and image processing.Experience implementing image processing algorithms in Python or MATLAB.Experience using deep learning frameworks such as TensorFlow or PyTorch.Experience training and validating convolutional neural networks for computer vision applications.Excellent analytical and problem-solving skills.Excellent communication and writing skills.Must reside in Bay Area.\nPreferred Qualifications\nPh.D. in Electrical Engineering, Computer Science, Mathematics, or equivalent field.Knowledge of.5+ years of experience in signal/image processing algorithm research & development.Experience developing machine learning models for mobile, IoT, or edge devices.Experience with neural network optimization methods (e.g. pruning, quantization, etc.).Experience with data collection and data cleaning for training deep learning models.Experience with OpenCV.Proficiency in C/C++.Strong mathematical background in probability, statistics, and linear algebra.\nSony Electronics is an Equal Opportunity Employer that values employees with a broad cross-cultural perspective. We strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond. All applicants will receive fair and impartial treatment without regard to race, color, religion, sex, national origin, ancestry, citizenship status, age, legally protected physical or mental disability, protected veteran status, status in the U.S. uniformed services, sexual orientation, gender identity or expression, marital status, genetic information or on any other basis which is protected under applicable federal, state or local law.\nDisability Accommodation for Applicants to Sony Electronics, Inc.\nSony Electronics, Inc. provides reasonable accommodation for qualified individuals with disabilities and disabled veterans in job application procedures. For reasonable accommodation requests, please contact us by email at talenthelp@am.sony.com, or you can mail your resume to: Sony Electronics, Human Resources Department, 16535 Via Esprillo, San Diego CA 92127. Please indicate the position you are applying for.\nEEO is the Law\nEEO is the Law Supplement\nRight to Work (English/Spanish)\nE-Verify Participation (English/Spanish)"}, {"position": "Compiler Developer - multiple levels (remote)", "company": "Qualcomm", "date": "4 days ago", "type": "Full-time", "description": "Company\n\nQualcomm Technologies, Inc.\n\nJob Area\n\nEngineering Group, Engineering Group > Machine Learning Engineering\n\nGeneral Summary\n\nIf you’re interested in advancing and applying mathematics to program optimization for cutting-edge computer architectures, then you really want to be talking to us!\n\nThe Reservoir Labs department in Qualcomm Corporate Research and Development is looking for Compiler Developers join our growing team. We work on developing new and innovative compilers that break the mold of current computing. We are tackling some of the most interesting and challenging problems in high performance computing, including designing compilers for high performance embedded computing systems, for machine learning, for advanced signal processing, extended reality (xR), and new paradigm changing applications.\n\nYour work at Qualcomm will embody the We Are Limitless experience – inspired, freedom to invent, and the opportunity to change the world one wireless connection at a time.\n\nMinimum Qualifications\n\nMinimum Qualifications:\n\nBachelor's degree in Computer Science, Engineering, Information Systems, or related field.\n\nJob Responsibilities\n Work on a wide range of projects within small teams of engineers Frequently interact with external and internal clients and effectively identify and meet client needs Author research publications and represent the company in conferences and industry forums Opportunity to lead and manage projects while doing substantial technical work\n\nDesired Skills\n An advanced degree in the field of computer science or applied mathematics Experience with compiler development, and computer architecture Experience with software engineering Solid intellectual ability, motivation, and a strong history of achievement Excellent oral and written communication skills\n\nGenuine interest in the spectrum of Qualcomm’s 5G, xR, and AI projects is key, and the flexibility to move among them is essential. A substantial part of this work\n\nLocation is flexible for on-site or remote.\n\nQualcomm is committed to hiring and supporting individuals with disabilities. Although this role has some expected physical activity, an inability to perform one or more of the listed physical requirements should not deter otherwise qualified applicants from applying. We will work with you throughout the application and onboarding process to provide reasonable accommodations. Examples of expected physical activity include: frequently transporting between offices, buildings, and campuses up to ½ mile; frequently transporting and installing equipment up to 5 lbs.; performing tasks at various heights (e.g., standing or sitting); monitoring and utilizing computers and test equipment for more than 6 hours a day; and continuous communication which includes the comprehension of information with colleagues, customers, and vendors both in person and remotely.\n\nAlthough this role has some expected minor physical activity, this should not deter otherwise qualified applicants from applying. If you are an individual with a physical or mental disability and need an accommodation during the application/hiring process, please call Qualcomm’s toll-free number found here for assistance. Qualcomm will provide reasonable accommodations, upon request, to support individuals with disabilities as part of our ongoing efforts to create an accessible workplace.\n\nQualcomm is an equal opportunity employer and supports workforce diversity.\n\nTo all Staffing and Recruiting Agencies: Our Careers Site is only for individuals seeking a job at Qualcomm. Staffing and recruiting agencies and individuals being represented by an agency are not authorized to use this site or to submit profiles, applications or resumes, and any such submissions will be considered unsolicited. Qualcomm does not accept unsolicited resumes or applications from agencies. Please do not forward resumes to our jobs alias, Qualcomm employees or any other company location. Qualcomm is not responsible for any fees related to unsolicited resumes/applications.\n\nEEO Employer: Qualcomm is an equal opportunity employer; all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or any other protected classification.\n\nPay Range\n\n$123,000.00 - $184,000.00\n\nIf you would like more information about this role, please contact Qualcomm Careers."}, {"position": "Associate Software Engineer - Mob Programming (REMOTE)", "company": "Hunter Industries", "date": "3 weeks ago", "type": "Full-time · Entry level", "description": "We are a global leader in the irrigation, outdoor lighting, dispensing technology, and custom manufacturing industries. Driving our continued success is the combined energy and talents of the nearly 3,000 people on our team. Together, we create a diverse array of products that can be seen all over the world, from residential landscapes to national landmarks, stadiums, parks, hotels, and municipal buildings. Although we’re global, we’re family owned, and our casual, fun, and caring company culture is what makes this a special place to work. As we grow, we are dedicated to preserving our unique culture that makes our employees proud to work here. Whether you’re pursuing a career at our headquarters in Southern California, or an opportunity at one of our state-of-the-art manufacturing facilities, or something somewhere in between, we look forward to welcoming you to Hunter Industries and our Family of Companies.\nCompany: Hunter\nDivision: Residential, Commercial, and Golf Irrigation & Lighting\nAbout This Role\nThe Associate Software Engineer develops software using the Mob Programming process and using development practices guided by the Agile Manifesto and principles. S/he improves and revises the team’s development process using Agile Retrospectives and achieves technical excellence utilizing the Manifesto for Software Craftsmanship.\nDemonstrates behavior that is consistent with the company’s values of Customer Satisfaction, Innovation, Family, and Social Responsibility.\nEssential Functions\nLearns and contributes to Mob Programming (https://www.youtube.com/watch?v=dVqUcNKVbYg).Learns and contributes to Extreme Programming.Learns and contributes to maintaining software utilizing Object Oriented Programming (sometimes functional programming).Learns and contributes to ensuring code quality with Test Driven Development.Learns and contributes to ensuring maintainable interdependencies with Behavior Driven Development or Full-stack Integration Tests.Learns and contributes to enabling and executing Continuous Deployment with Continuous Delivery.Learns and contributes to mentoring and cross-train other team members with the goal of elevating the entire team’s skill set and knowledge.Learns and contributes to designing, querying, and maintaining SQL databases.Learns and contributes to understand Code Craftsmanship.\nOther Job Functions\nPerforms other related tasks as assigned, some of which may become essential to the position.\nEducation/Training Required And Preferred\nBachelor’s degree in Computer Science or equivalent training and work experience.\nExperience Required And Preferred\nAny programming experience in Software Development.\nWhat You Bring\nExcellent interpersonal skills, with ability to interact with members across the organization.Knowledge of any of the following: .NET, JavaScript, Typescript, TDD, BDD, SQL, XAML, Angular, ASP.NET, MVC, HTML5, CSS, jQuery, JSON, Entity Framework, Node JS, Web Services, Visual Studio, Object Oriented Programming, Functional Programming, IOT, GIT, AWS Cloud, Azure Cloud, LINQ, MQTT, GO.CD, Tools created by JetBrains & Red Gate.Must be comfortable working in groups.Ability to use Behavior Driven Development and Test-Driven Development practices.Ability to proactively seek knowledge and proficiency of new skills while interacting and working closely with the team.Ability to recognize and act on the opportunity to share knowledge with other team members. Excellent verbal and written communication skills in English.\nWhat We Offer\nAmazing corporate culture - we walk the walk when it comes to our values!Beautiful 20 acre park like campus with creek and walking trailsOn site wellness center with personal training, fitness classes and massageFUN company events!Annual performance reviews and profit sharing bonus\nFollow us on LinkedIn, check out our rave reviews on Glassdoor, and learn more about our company culture on our career site: http://corporate.hunterindustries.com/careers \nHunter Industries and its Family of Companies is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, disability, gender, gender identity or expression, military and veteran status, national origin, race, religion, sexual orientation, or any other applicable legally protected status or characteristic."}, {"position": "Senior Mobile Software Engineer", "company": "Fabletics", "date": "48 minutes ago", "type": "Full-time · Mid-Senior level", "description": "Job Description\nTechStyleOS is looking for a Remote Senior Mobile Software Engineer on our Mobile App Team.\nTechStyleOS is the global integrated business service provider behind several fashion brands. Our team combines the functions of data-driven marketing, technology, supply chain, fulfillment, and customer service all under one roof. Our integrated services builds and implements customized solutions to help brands launch, scale, and grow - both across product categories and geographically.\nWe are looking for a Senior Engineer who is excited to be part of a team that builds the Fabletics and JustFab native iOS and Android Apps while delivering cutting edge shopping experiences to millions of our consumers worldwide. You will collaborate and grow with a high-performing and diverse squad of front and back-end engineers in collaboration with Product, Design, and Marketing teams.\nThis position will be reporting to the Manager of Engineering for Mobile App.\nWhat You Will Bring\n3+ years experience with React Native5+ years experience with mobile application languages, Objective-C/Swift5+ years experience with REST, JSON RPC or other API stylesUnit testing experience; TDD/BDD a major plusVersion control with GitA passion for quality and an attention to detailWorked on projects using Agile/ScrumBachelor’s degree in Computer Science or equivalent work experienceComfortability and flexibility with occasional travel to HQ in Los Angeles to interface with teams face-to-face\nOur Tech & Tools\nReact Native, Objective-C & SwiftGraphQL, REST & JSONRPC backends\nWhat You Will Be Doing\nFocused on meeting the needs of the product, and engineering teams by developing and maintaining user-facing featuresWrite unit tests and build reusable code and libraries for future use; documentation is a mustWork closely with UX designers to discuss and ensure the technical feasibility of UI/UX designsOptimize applications for maximum speed and scalabilityDay-to-day collaboration with acquisition teams, marketing teams, as well as stakeholdersInterface with offshore Back-End Developers to ensure alignment for project tasks\nWhat We Offer\n401K matchAnnual Bonus PlanCompetitive Salary and Equity StructureUnlimited Discretionary PTOHealth & Wellness BenefitsLearning & Development opportunitiesAnd more!\nWhere We Are\nThis role will be remote, but our company headquarters is in El Segundo, CA\nAbout TechStyleOS\nTechStyleOS is the globally integrated Operations and Services provider behind some of the fastest growing online fashion brands in history, including Fabletics, Savage X Fenty, JustFab, ShoeDazzle, and FabKids. With capabilities spanning technology, data science, supply chain management, fulfillment, customer service, and more, we help brands launch, scale and grow—across product categories and geographically. From predictive analytics to data-driven marketing and attribution, our unique approach is powered by our proprietary, end-to-end tech platform that enables the brands we serve to deliver a level of personalization, value, and satisfaction that are unrivaled in the fashion industry.\nFabletics, Inc. is an equal opportunity employer. We recruit, employ, compensate, develop, and promote regardless of race, national origin, religion, sex, sexual orientation, gender identity, age, disability, genetic information, veteran status, and other protected status as required by applicable. At Fabletics, Inc., we champion a vibrant workplace culture that thrives on diversity law and do not tolerate discrimination or harassment. We are one team from many backgrounds, innovating through diversity of individuals, who are driven by passion for creating an inclusive space for all. Fabletics, Inc. will continue to champion a workplace culture that prizes diversity and inclusivity.\nWe encourage you to apply regardless of meeting all qualifications and/or requirements."}, {"position": "Python Developer", "company": "NerdUp!", "date": "2 hours ago", "type": "$120,000/yr - $150,000/yr · Full-time · Mid-Senior level", "description": "Want a fabulous hands-on (yes, you get to code to your heart's content!) contributing to products used by 40M+ dedicated readers across the globe -- from prototype to announcement and beyond?\nYou'll develop code for the next gen product roadmap, while building AI tools and SaaS platforms.\nBring your wealth of experience of end-to-end web applications.\nAbout You:\nYour communication skills are excellent: you can understand user needs and translate them into actionable pieces of work that teams can understandEnjoy guiding craftsmanship, security, availability, resilience, and scalability of solutionsBachelor's Degree (required) in Computer Science5+ years of Python experienceAt least 1 year of AWS experienceAt least 3 years of Continuous Integration and Continuous Deployment experience"}, {"position": "Software Engineer I (Full Time) United States", "company": "Cisco", "date": "7 hours ago", "type": "Full-time", "description": "What You’ll Do\n\nOur software engineers are the gurus behind the scenes ensuring our all of our programs are easy to use and bug free. Using a keen eye, you’ll develop software and tools in support of many of our high-impact technology platforms such as operating systems, networks, databases and more. While we’re growing in the software business, you’ll still need to see the big picture and watch for hardware compatibility while even potentially influencing design.\n\nWho You’ll Work With\n\nOur hardworking team members are busy programming magic across the globe on teams such as Engineering, Information Technology, Supply Chain, Customer Experience, Security and Trust, etc.\n\nYou would play a crucial role in driving next-gen software innovations including cloud, mobile, desktop or security spaces. On any of these teams, you'll get hands-on experience working with applications that make technology accessible no matter what device they’re on. See the possibilities when creativity meets design and build solutions which will transform how we work, live, learn, and play.\n\nWho You Are\n\nIncluding but not limited to a graduate/upcoming graduate of a technical degree or certification program from a Technical Boot Camp, Apprenticeship, Community College or 4-Year University.\n\nUp-to-date on programming and scripting languages C/C++, Python, Java\n\nKnowledge of Linux, Networking concepts, OS fundamentals, Embedded Development, and/or ML\n\nHands on QA, Testing, and/or Debugging skills\n\nExperience with Databases, Web Application Development, and Web Services\n\nEligible to start July/August 2023\n\nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship\n\nWhy Cisco\n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.\n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box!\n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.)\n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward.\n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!"}, {"position": "Artificial Intelligence Group - Data Engineer", "company": "Bloomberg LP", "date": "2 weeks ago", "type": "Full-time", "description": "About Us The AI Group is the central engineering group responsible for driving Machine Learning (ML) adoption at Bloomberg, with 200 researchers and engineers working together to provide clients with the best-in-class news, research, market data, and analytics using state of the art machine learning technology. We directly impact a wide variety of Bloomberg's flagship products, including news, research, pricing, our communications platforms and search and discovery tools. We work on a variety of ML disciplines, including natural language processing, information retrieval, time series analysis, and recommender systems. What We Do What sets our group apart is end-to-end ownership of our models and services, which are distributed, high-throughput and low latency systems that are collectively called billions of times a day. In order to deliver at such scale, we are building platforms that enable our application-focused ML engineering teams to go from an idea to a model to a scalable service with minimal overhead. We also offer higher-level abstractions and UIs to enable domain experts to easily build, deploy and maintain production ML models for their applications in a self-service manner, with little engineering intervention. What We Need From You While working on the team as a Senior Data Engineer, you will have the opportunity to enhance our data pipelines and platforms that enable machine learning tasks. You will work with application, product, platform, and infrastructure teams to extract data from Bloomberg's vast data ecosystem and prepare it for analyzing, annotating, training, evaluating, serving, and other tasks. Typical activities include:\n Work with application and product teams to define data needs and SLAs Design, build, and deploy resilient, monitorable pipelines to transport and store data in various storage solutions Identify the appropriate storage solutions and for a given use case, understanding the tradeoffs in performance, cost, and complexity Model datasets with idiomatic schema design, tailored for a dataset's intended use Design and implement efficient data retrieval and processing solutions suited for our ML environments Collaborate with platform and infrastructure teams to influence the direction and support of various managed solutions Colleagues who excel in this role often exhibit these qualities:\n Experience with message queueing systems like Kafka Proven track record building ETL pipelines leveraging technologies such as Kafka Streams, Kafka Connect, Flink, or Spark Streaming Prior experience building or extending data lakes, using various storage, cataloging, and retrieval technologies such as S3, HDFS, Hadoop, HBase, Hive, Trino, Presto, Cassandra, Spark Instruments their pipelines, and is able to quickly pinpoint problems from dashboards and logs Proficiency in a programming language such as Scala, Java, or Python, and a willingness to learn new languages Familiarity with an workflow orchestration technology, such as Argo, Airflow, or Oozie Excellent communication skills and a willingness to collaborate with various stakeholders This position requires at least one of the following:\n A bachelor's degree in computer science or a related field, and/or An equivalent combination of education, and/or Specialized training, and/or Related professional experience. Bloomberg is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of age, ancestry, color, gender identity or expression, genetic predisposition or carrier status, marital status, national or ethnic origin, race, religion or belief, sex, sexual orientation, sexual and other reproductive health decisions, parental or caring status, physical or mental disability, pregnancy or parental leave, protected veteran status, status as a victim of domestic violence, or any other classification protected by applicable law.\n\nBloomberg is a disability inclusive employer. Please let us know if you require any reasonable adjustments to be made for the recruitment process. If you would prefer to discuss this confidentially, please email access2@bloomberg.net"}, {"position": "Software Engineer", "company": "AppYou", "date": "3 weeks ago", "type": "Full-time", "description": "Acerca De AppYou\nAppYou es una startup pre-semilla con clientes en Chile y EE.UU (New Jersey y California) enfocada en la búsqueda de soluciones en agricultura sustentable e inteligente. Durante 3 años hemos desarrollado aplicaciones móviles que integran aprendizaje estadístico y modelos fundacionales de lenguaje y visión para optimizar procesos logísticos en la cadena de distribución de productos agrícolas. Comprometidos con el eficiente manejo de la producción y distribución global de alimentos, apuntamos a convertirnos en líderes de la administración de datos centralizados en el sector agrícola en Latino América, EEUU y el mundo.\nNuestros Valores Fundamentales\nPreocupación - Somos una empresa de atención digital innovadora y atenta. Por eso buscamos cuidar a nuestros clientes y cuidarnos entre nosotros.Inclusividad - AppYou se enorgullece de proporcionar igualdad de oportunidades. Celebramos la diversidad y nos comprometemos a crear un entorno inclusivo para todos los empleados.\n Descripción de la Posición\nLa/el candidata/o ideal será responsable de desarrollar código/soluciones de software y mantener el código/software existente. Las responsabilidades incluyen:\nDiseñar y desarrollar aplicaciones móviles de alta calidad. Implementar código comprobable y escalable.Analizar procedimientos de producción de software y problemas.Hacer recomendaciones de mejoras en eficiencia, workflow, etc.Colaborar constantemente con el equipo de desarrollo de software y dirección de operaciones para mantener un flujo de comunicación eficiente entre la visión de empresa y producción de software. \n Lo que buscamos\nEn AppYou, valoramos inmensamente la curiosidad, voluntad de aprender cosas nuevas y el deseo de trabajar en equipo. Con nosotros tendrás la oportunidad de aportar a la maximización del potencial del equipo, serás escuchada/o y motivada/o a hacer sugerencias sobre el funcionamiento del desarrollo y producción de software.\nLa/el candidata/o deberá cumplir con las cualificaciones básicas para ser considerada/o inicialmente para esta posición. Las cualificaciones preferidas son complementarias a los requisitos mínimos y serán consideradas como factores ventajosos en la identificación del mejor candidato.\nCualificaciones Básicas\nExcelente comprensión de Programación Orientada a Objetos, la arquitectura RESTful, bases de datos y arquitecturas de software.Experiencia en proyectos de React o React Native.Manejo avanzado de Python, JavaScript/TypeScript, HTML, CSS y SQL.Fuerte resolución de problemas, habilidades analíticas y técnicamente práctico.Excelentes habilidades de organización, comunicación, escritura y relaciones interpersonales.\nCualificaciones Preferidas\nTitulación en Ciencias de la Computación, Ingeniería de Software o equivalente.Experiencia usando servicios de AWS.Experiencia en Python y modelos de inteligencia artificial (Hugging Face, TensorFlow, PyTorch).\nEn AppYou estamos comprometidos con asegurar un ambiente laboral diverso e inclusivo. El proceso de selección de candidata/o se basa en la igualdad de oportunidades y no discrimina basado en identidad de género, orientación sexual, raza, nacionalidad, u otros estados protegidos legalmente.\n Detalles de la Oportunidad\nTipo: Full-time.\nHorario: 40 horas semanales.\nModalidad: Remota.\nSueldo: 2000 USD bruto con posibilidad de acciones."}, {"position": "Infrastructure Developer - Blockchain", "company": "Algo Capital Group", "date": "2 hours ago", "type": "$200,000/yr - $250,000/yr · Full-time · Mid-Senior level", "description": "Infrastructure Developer - Blockchain\nA global systematic hedge fund has built out a multi-billion crypto and Defi trading group. Seeking a Blockchain Infrastructure Developer to join the founding team of a new trading unit. \nThis is a unique opportunity to join an elite team and contribute to on-chain trading activities. The blockchain developer they seek has a passion for Defi and is highly interested in node codebases.The position offers the opportunity to modify and interoperate with nodes and other blockchain components for on-chain trading activities. Working on real-time problems in Defi Trading working alongside the top software engineers, quant researchers, traders, and machine learning experts. \nRequirements:Years of node-related development experienceGolang, Rust will be intrinsic to this role\n Desirable skills:Good knowledge of chain roadmaps and upcoming chain projectsA sophisticated understanding of the full networking stack from a hardware and a software perspective with a specific focus on maximizing performanceOpen-source contributions or side projectsExperience or interest in finance\nFollow Algo Capital Group for updates: https://www.linkedin.com/company/algocapitalgroup/"}]